{
  "maqolalar": [
    {
      "nomi": "Qushlar",
      "id": "qush1235"
    },
    {
      "nomi": "Baliqlar",
      "id": "baliq554235"
    },
    {
      "nomi": "O'simliklar",
      "id": "Osimlik554235"
    }
  ],
  "maqolalarmalumot": [
    {
      "nomi": "Qushlar",
      "id": "qush1235",
      "matni": "Qushlar — umurtqali hayvonlar sinfi. Trias davrida yashagan sudralib yuruvchilarning psevdozuxlar turkumidan kelib chiqqanligi taxmin qilinadi. Qushlarning qazilma qoldiqlari juda kam; dastlabki qazilma qoldiq — arxeopteriksnshk toshdagi izi va suyaklari yura davriga tegishli. Ayrim morfologik belgilar (orqa oyoqlardagi muguz tangachalar, muguz tumshuq va boshqalar) hamda fiziologik xususiyatlari (tuxum qo'yishi)ga ko'ra qushlar sudralib yuruvchilarga o'xshaydi, lekin tanasi pat bilan qoplanganligi tufayli ulardan farq qiladi. Patlar qushlar tanasida issiqlikni saqlaydi; uchishda havo qarshiligini kamay-tirib, havoda ko'tarish yuzasini hosil qiladi (qanot, dum). Uchish va har xil harakatlanish (yugurish, suzish, sho'ng'ish)ga moslanish qushlar tayanch-harakat sistemasining o'ziga xos tuzilishiga sabab bo'lgan. Qanotlarning paydo bo'lishi bilan oldingi oyoklar, yelka kamari suyaklari va muskullari shakllangan (ko'krak toj suyagi rivojlangan, uchish muskullari tana vaznining 25% ini tashkil etgan); yerda 2 oyoqda yurganida murakkab yaxlit tuzilgan dumg'aza va orqa oyoqlari muskullari qayta muvo-zanat saqlash vazifasini bajaradi. Qushlarning qovurg'alari o'zaro harakatchan qo'shilgan 2 qismdan iborat bo'lib, nafas olishda ko'krak qafasi hajmining o'zgarishiga, ya'ni elastikligi kam o'pka to'qimasi orqali havoni havo xaltalariga va naysimon suyaklar bo'shlig'iga o'tishiga yordam beradi. Qushlarda nafas olish jarayoni o'ziga xos kechadi. Qushlarning bronxlari havo xaltachalari bilan (9—10 tacha) tutashgan. Nafas olish havo o'pkadan xaltachalarga o'tayotganida va ulardan yana o'pka orqali qaytib chiqayotganida sodir bo'ladi. Havo xaltachalari termoregulyatsiyada ishtirok etadi; suvda suzuvchi qushlarda esa sho'ng'ishda tana tig'izligini o'zgar-tirishga imkon beradi. Ovqat xiliga moslanish qizilo'ngachning ixtisosla-shuvi (ayrim qushlarda jig'ildonning rivojlanishi), muskulli oshqozonning paydo bo'lishi va ichakning uzayishiga olib kelgan. Qushlarning to'g'ri ichagi rivojlanmagan. Ayirish org'anlari 2 ta yirik buyraklar tana vaznining 1 — 2% ini tashkil etadi; qovug'i bo'lmaydi. Ichagi, siydik chiqarish va jinsiy bezlari sistemasi yo'li kloakaga ochiladi. Qattiq po'choq bilan qoplangan yirik tuxum qo'yishi tufayli qushlarning chanoqkamari suyaklari yiriklashgan. Qushlar narida 2 tadan urug'don va urug' yo'li, modasida faqat chap tuxumdon va tuxum yo'li rivojlangan (yapaloqqushlar va yirtqich qushlarda o'ng qismi ham bor). Urug'don va tuxumdonlar o'lchami jinsiy sikl davriga bog'liq. Masalan, uya qurish oldidan urug'donlar 300—1000 marta kattalashadi. Qon aylanish sistemasining tuzilishi va fiziologik xususiyatlari, yuragining nisbatan yirik bo'lishi va jadal ishlashi, yuqori qon bosimi moddalar almashinuvining tezlashuvi bilan bog'liq. Masalan, kolibr yuragi tana massasining 2,85% ini tashkil etadi; 1 daqiqada 1000 martagacha qisqaradi. Ko'rish o'tkirligi va rang ajrata olish, yaxshi eshitish xususiyati qushlarning yaqin va uzoqdagi narsalarni tezroq tanib olishida, tur individlari va turlar o'rtasidagi munosabatlarda katta ahamiyatga ega. Qushlarning tovushlarni taniy olish va tovush chiqarish xususiyatlari rivojlangan. Bosh miya bazal yadrolarining rivojlanganligi, ko'rish bo'laklari va miyachaning yirikligi qushlar nerv faoliyatining sudralib yuruvchilarga nisbatan yuqori bo'lishiga olib kelgan. Qushlar muhit sharoitiga o'z ehtiyojiga qarab faol moslanish (uya qurish, oziq g'amlash va boshqalar) xususiyatlarga ega. Qushlar quruqlik umurtqalilari orasida eng xilma-xil hayvonlar. Ular 2 kenja sinf: kaltakesak dumlilar (1 ta qirilib ketgan turkum kiradi) va yelpig'ich dumlilarga ajratiladi. Yelpig'ich dumlilarga 34 turkum (jumladan 28 ta hozirgi turkum) va 9000 ga yaqin tur kiradi. Qushlar Arktikadan boshlab Antarktika sohalarigacha bo'lgan barcha tabiiy mintaqalarda, ko'pchilik (80% ga yaqin) turlari tropik mintaqalarda tarqalgan. O'zbekiston faunasida qushlarning 19 turkumga oid 440 dan ko'proq turi ma'lum."
    },
    {
      "nomi": "Baliqlar",
      "id": "baliq554235",
      "matni": "Baliqlar (Pisces) — umurtqalilar kenja tipining katta sinfi, juda keng tarqalgan. Tuzilishi, hayot kechirishi va ekologik xususiyati suv muhitiga juda yaxshi moslangan. Baliqlarning qadimgi ajdodlari lansetnikka oʻxshash sodda tuzilgan xordalilar boʻlgan. Tarixiy rivojlanish davomida dastlabki xordalilardan juft suzgich qanotli hayvonlar paydo boʻlgan. Ular yirtqich hayot kechirishgan. Oʻlja axtarib faol hayot kechirishi natijasida ularning nerv sistemasi va sezgi organlari rivojlana borib yoʻl bilan baliqlar kelib chiqqan. Baliqlar suvda yashovchi xordali hayvonlar. Tanasi ikki yondan siqilgan, tangachalar bilan qoplangan, uchta toq, ikkita juft suzgichlari bor. Jabra orqali nafas oladi. Yuragi ikki kamerali, 109 tadan ortiq turi mavjud qon aylanish sistemasi bitta doiradan, nerv sistemasi bosh miya va orqa miyadan iborat. Baliq sezgi organlari ko'z, quloq, burun, mo'ylov va yon chiziqlardan iborat. Baliq uzoqni ko'rolmaydi. U bir metr uzoqlikdagi narsalarni ko'roladi. Ammo o'roqsimon o'simtaning qisqarishi tufayli u 12 metr uzoqlikdagi narsanini ham ko'ra oladi. Baliq eshitish organi ichki quloqdan iborat. Suv zich muhitda bo'lgani uchun baliq juda yaxshi eshitadi. U hatto qirg'oqdagi qadam tovushinini ham eshita oladi. Hamma hayvon sigari uning ham hid sezish qobiliyati kuchli. Ba'zi baliqlarda mo'ylov ham bor. Mo'ylov his tuyg'u vazifasini bajaradi. Yon chiziqlar nerv hujayralaridan iborat. Yon chiziqlar orqali oldindagi to'siqlarni, harakatlanayotgan o'ljan bemalol sezadi. Agar baliq ko'r bo'lib qolsa, yon chiziqlar orqali bemalol yasha oladi."
    },
    {
      "nomi": "O'simliklar",
      "id": "Osimlik554235",
      "matni": "Oʻsimliklar — tirik organizmlar dunyosi; fotosintez qilish xususiyatiga ega boʻlgan avtotrof organizmlar (qarang Avtotroflar); hujayra poʻsti, odatda, qalin sellyulozadan, zaxira oziq moddasi kraxmaldan iborat. Ayrim Oʻ. (saprofitlar, parazitlar) uchun xos boʻlgan geterotrof oziqlanish ikkilamchi hisoblanadi. Oʻ.ga xos boshqa xususiyatlar (oʻziga xos rivojlanish sikli, organlarning shakllanish yoʻli, yopishib yashash va boshqalar) hamma Oʻ.ga tegishli emas. Lekin bu belgilarning majmui Oʻ.ni boshqa tirik organizmlardan oson farq qilishga imkon beradi. Faqat tuzilishning quyi, ayniqsa, bir hujayralilar darajasida Oʻ. bilan boshqa organizmlar oʻrtasidagi farq uncha aniq sezilmaydi; shuning uchun evglenasimon suvoʻtlarni zoologlar bir hujayrali hayvonlarga kiritishadi. Bir hujayrali Oʻ.ning boshqa bir hujayrali organizmlardan asosiy farqi — xloroplastlar boʻlishidir. Tuzilish darajasi orta borgan sari Oʻ. bilan boshqa organizmlar oʻrtasidagi farq ham orta boradi. Oʻ.ning oziqlanish jarayonida atrof muhitdan gazsimon (fotosintez) va suyuq (suv va unda erigan mineral tuzlar) moddalarni shimib olishga moslanishi natijasida ularning tanasi yuzasi tobora kengayib borgan. Yuksak oʻsimliklarda tana yuzasining kengayishi va ixtisoslashuvi toʻqimalar va vegetativ organlarning rivojlanishiga olib kelgan (qarang Toʻqima, Vegegpativ organlar). Oʻ. tuzilishining koʻpchilik muhim xususiyatlari ularning oʻsishi va koʻpayishi, shuningdek, tarqalishiga moslanishi bilan bogʻliq. Anʼanaga koʻra, 20-asrning oʻrtalarigacha barcha oʻsimliklar tuban (bakteriyalar, suvoʻtlar, zamburugʻlar, lishayniklar) va yuksak oʻsimliklar (yoʻsinlar, psilofitlar, plaunlar, qirqboʻgʻimlar, qirqquloqlar, ochiq urugʻlilar, gulli oʻsimliklar)ga ajratib kelingan. Hozirgi bakteriyalar va zamburugʻlar alohida dunyoga ajratiladi. Oʻ. dunyosi 3 kichik dunyo: qizil suvoʻtlar va yuksak Oʻ.ga boʻlinadi. Bu kichik dunyolar 350 000 turdan iborat barcha Oʻ.ni oʻz ichiga oladi. Oʻ.ning kelib chiqishi yerda hayot paydo boʻlishining ilk rivojlanish davrlariga toʻgʻri keladi. Bunda Arxey erasida (bundan 3 mlrd. yil oldin) koʻkyashil suvoʻtlar (sianobakteriyalar)ga oʻxshash organizmlar paydo boʻlgan. Haqiqiy suvoʻtlar proterozoy erasida, yashil va qizil suvoʻtlar paleozoyning boshlarida paydo boʻganligi taxmin qilinadi. Dastlabki yuksak Oʻ. — riniofitlar proterozoy va paleozoy chegarasida kelib chiqqanligini ehtimol qilish mumkin. Ularda ildiz oʻrniga rizoidlari boʻlgan. Karbonda daraxtsimon qirqquloqlar kelib chiqqan; permda ular oʻrnini hozirgi qirqquloqlar egallagan. Karbonda ignabargli oʻsimliklar paydo boʻlgan, trias va yura davrlarida ular keng tarqalgan. Boʻr davrining boshlarida gulli Oʻ. (yopiq urugʻlilar) hosil boʻlgan va shundan soʻng ular Yer florasida hukmron boʻlib qolgan. Oʻ. Yerda mavjud boʻlgan barcha tirik organizmlar hayotida katta ahamiyatga ega. Hayvonlar va odamning hayotini Oʻ.siz tasavvur qilib boʻlmaydi. Faqat yashil xlorofillga ega boʻlgan Oʻ. anorganik moddalardan organik birikmalarni sintezlash orqali quyosh nuri energiyasini toʻplaydi; ayni vaqtda Oʻ. atmosferadan S02gazini olib, atmosferaga   deyarli barcha tirik organizmlarning nafas olishi uchun zarur boʻlgan kislorod chiqaradi. Shu yoʻl bilan yashil Oʻ. atmosfera tarkibining doimiyligini saqlab turadi. Oʻ. organik moddalarni hosil qiluvchi produtsentlar sifatida oziq zanjirining asosini tashkil etadi."
    }
  ],
  "maqolalarcomment": [
    {
      "maqola": "baliq554235",
      "kimdan": "Jahongir",
      "comment": "Assalomu alaykum va rohmatullohu va barakot",
      "id": 7
    },
    {
      "maqola": "Osimlik554235",
      "kimdan": "Shaxboz",
      "comment": "Chuchvara otmen",
      "id": 8
    },
    {
      "maqola": "qush1235",
      "kimdan": "Jahongir",
      "comment": "Bu maqola ajoyib chiqibdi",
      "id": 9
    }
  ]
}